<!-- dflook/terraform-github-actions {"workspace":"multi-arch-base-2","backend_type":"remote","backend":"94c8e47ad22fb217378f62ec902ae8dd32a40d6247e74efe850a89fdd3dbcce2","plan_job_ref":"Job Test Terraform cloud #141 at https://github.com/dflook/terraform-github-actions/actions/runs/4336662950","plan_hash":"5355b5d66054ac7b48b0600e76842c9d511e9ee256287ed16c4c7cd45aa0e01a","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __multi-arch-base-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #141](https://github.com/dflook/terraform-github-actions/actions/runs/4336662950)